sanhab-templates/Fire/Fire-Payment-Bill-soapTemplate.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:fir="http://schemas.datacontract.org/2004/07/FirLogic.DataModel">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:CiiRegLos>
         <!--Optional:-->
         <tem:req>
            <!--Optional:-->
            <fir:Amnt>${Amnt}</fir:Amnt>
            <!--Optional:-->
            <fir:CardexInqCode>${CardexInqCode}</fir:CardexInqCode>
            <!--Optional:-->
            <fir:CmpDocNo>${CmpDocNo}</fir:CmpDocNo>
            <!--Optional:-->
            <fir:CurCod>${CurCod}</fir:CurCod>
            <!--Optional:-->
            <fir:CurrencySource>${CurrencySource}</fir:CurrencySource>
            <!--Optional:-->
            <fir:FirDocLosCod>${FirDocLosCod}</fir:FirDocLosCod>
            <!--Optional:-->
            <fir:FirLosCvrs>
               <!--Zero or more repetitions:-->
               <fir:FirLosCvr>
                  <!--Optional:-->
                  <fir:CvrCod>${CvrCod}</fir:CvrCod>
                  <!--Optional:-->
                  <fir:InsrdCmpDocNo>${InsrdCmpDocNo}</fir:InsrdCmpDocNo>
                  <!--Optional:-->
                  <fir:PayAmnt>${PayAmnt}</fir:PayAmnt>
               </fir:FirLosCvr>
            </fir:FirLosCvrs>
            <!--Optional:-->
            <fir:Frnshz>${Frnshz}</fir:Frnshz>
            <!--Optional:-->
            <fir:HvTypCod>${HvTypCod}</fir:HvTypCod>
            <!--Optional:-->
            <fir:Hvno>${Hvno}</fir:Hvno>
            <!--Optional:-->
            <fir:IsCncl>${IsCncl}</fir:IsCncl>
            <!--Optional:-->
            <fir:IsFrgn>${IsFrgn}</fir:IsFrgn>
            <!--Optional:-->
            <fir:LglRefDte>${LglRefDte}</fir:LglRefDte>
            <!--Optional:-->
            <fir:LosRcvTypCod>${LosRcvTypCod}</fir:LosRcvTypCod>
            <!--Optional:-->
            <fir:PayAmnt>${PayAmnt}</fir:PayAmnt>
            <!--Optional:-->
            <fir:PayDte>${PayDte}</fir:PayDte>
            <!--Optional:-->
            <fir:PsprtNo>${PsprtNo}</fir:PsprtNo>
            <!--Optional:-->
            <fir:RcvBrthDte>${RcvBrthDte}</fir:RcvBrthDte>
            <!--Optional:-->
            <fir:RcvFNam>${RcvFNam}</fir:RcvFNam>
            <!--Optional:-->
            <fir:RcvLNam>${RcvLNam}</fir:RcvLNam>
            <!--Optional:-->
            <fir:RcvLglId>${RcvLglId}</fir:RcvLglId>
            <!--Optional:-->
            <fir:RcvLglNam>${RcvLglNam}</fir:RcvLglNam>
            <!--Optional:-->
            <fir:RcvNtnlId>${RcvNtnlId}</fir:RcvNtnlId>
            <!--Optional:-->
            <fir:RcvShebaNo>${RcvShebaNo}</fir:RcvShebaNo>
            <!--Optional:-->
            <fir:Rcy>${Rcy}</fir:Rcy>
            <!--Optional:-->
            <fir:losCardexesGoods>
               <!--Zero or more repetitions:-->
               <fir:LosCardexesGoods>
                  <!--Optional:-->
                  <fir:CardexCode>${CardexCode}</fir:CardexCode>
                  <!--Optional:-->
                  <fir:GoodsDesc>${GoodsDesc}</fir:GoodsDesc>
                  <!--Optional:-->
                  <fir:GoodsId>${GoodsId}</fir:GoodsId>
                  <!--Optional:-->
                  <fir:MeasurementUnit>${MeasurementUnit}</fir:MeasurementUnit>
                  <!--Optional:-->
                  <fir:ModifyDate>${ModifyDate}</fir:ModifyDate>
                  <!--Optional:-->
                  <fir:ProductionType>${ProductionType}</fir:ProductionType>
                  <!--Optional:-->
                  <fir:RemovableCount>${RemovableCount}</fir:RemovableCount>
               </fir:LosCardexesGoods>
            </fir:losCardexesGoods>
            <!--Optional:-->
            <fir:losGoods>
               <!--Zero or more repetitions:-->
               <fir:losGood>
                  <!--Optional:-->
                  <fir:Cptl>${Cptl}</fir:Cptl>
                  <!--Optional:-->
                  <fir:CptlCurCod>${CptlCurCod}</fir:CptlCurCod>
                  <!--Optional:-->
                  <fir:GoodsDesc>${GoodsDesc}</fir:GoodsDesc>
                  <!--Optional:-->
                  <fir:GoodsId>${GoodsId}</fir:GoodsId>
                  <!--Optional:-->
                  <fir:InsrdCmpDocNo>${InsrdCmpDocNo}</fir:InsrdCmpDocNo>
                  <!--Optional:-->
                  <fir:MeasurementUnit>${MeasurementUnit}</fir:MeasurementUnit>
                  <!--Optional:-->
                  <fir:OwnerNationalId>${OwnerNationalId}</fir:OwnerNationalId>
                  <!--Optional:-->
                  <fir:PostalCode>${PostalCode}</fir:PostalCode>
                  <!--Optional:-->
                  <fir:RemovableCount>${RemovableCount}</fir:RemovableCount>
               </fir:losGood>
            </fir:losGoods>
         </tem:req>
         <!--Optional:-->
         <tem:Username>${Username}</tem:Username>
         <!--Optional:-->
         <tem:Password>${Password}</tem:Password>
      </tem:CiiRegLos>
   </soapenv:Body>
</soapenv:Envelope>